ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG0" offset="0x300" width="32" description="">
		<bitfield id="ENABLE_31" width="1" begin="31" end="31" resetval="0x0" description=" Enable (set) for intr_in[31]" range="31" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_30" width="1" begin="30" end="30" resetval="0x0" description=" Enable (set) for intr_in[30]" range="30" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_29" width="1" begin="29" end="29" resetval="0x0" description=" Enable (set) for intr_in[29]" range="29" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_28" width="1" begin="28" end="28" resetval="0x0" description=" Enable (set) for intr_in[28]" range="28" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_27" width="1" begin="27" end="27" resetval="0x0" description=" Enable (set) for intr_in[27]" range="27" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_26" width="1" begin="26" end="26" resetval="0x0" description=" Enable (set) for intr_in[26]" range="26" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_25" width="1" begin="25" end="25" resetval="0x0" description=" Enable (set) for intr_in[25]" range="25" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_24" width="1" begin="24" end="24" resetval="0x0" description=" Enable (set) for intr_in[24]" range="24" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_23" width="1" begin="23" end="23" resetval="0x0" description=" Enable (set) for intr_in[23]" range="23" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_22" width="1" begin="22" end="22" resetval="0x0" description=" Enable (set) for intr_in[22]" range="22" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_21" width="1" begin="21" end="21" resetval="0x0" description=" Enable (set) for intr_in[21]" range="21" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_20" width="1" begin="20" end="20" resetval="0x0" description=" Enable (set) for intr_in[20]" range="20" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_19" width="1" begin="19" end="19" resetval="0x0" description=" Enable (set) for intr_in[19]" range="19" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_18" width="1" begin="18" end="18" resetval="0x0" description=" Enable (set) for intr_in[18]" range="18" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_17" width="1" begin="17" end="17" resetval="0x0" description=" Enable (set) for intr_in[17]" range="17" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_16" width="1" begin="16" end="16" resetval="0x0" description=" Enable (set) for intr_in[16]" range="16" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_15" width="1" begin="15" end="15" resetval="0x0" description=" Enable (set) for intr_in[15]" range="15" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_14" width="1" begin="14" end="14" resetval="0x0" description=" Enable (set) for intr_in[14]" range="14" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_13" width="1" begin="13" end="13" resetval="0x0" description=" Enable (set) for intr_in[13]" range="13" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_12" width="1" begin="12" end="12" resetval="0x0" description=" Enable (set) for intr_in[12]" range="12" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_11" width="1" begin="11" end="11" resetval="0x0" description=" Enable (set) for intr_in[11]" range="11" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_10" width="1" begin="10" end="10" resetval="0x0" description=" Enable (set) for intr_in[10]" range="10" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_9" width="1" begin="9" end="9" resetval="0x0" description=" Enable (set) for intr_in[9]" range="9" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_8" width="1" begin="8" end="8" resetval="0x0" description=" Enable (set) for intr_in[8]" range="8" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_7" width="1" begin="7" end="7" resetval="0x0" description=" Enable (set) for intr_in[7]" range="7" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_6" width="1" begin="6" end="6" resetval="0x0" description=" Enable (set) for intr_in[6]" range="6" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_5" width="1" begin="5" end="5" resetval="0x0" description=" Enable (set) for intr_in[5]" range="5" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_4" width="1" begin="4" end="4" resetval="0x0" description=" Enable (set) for intr_in[4]" range="4" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_3" width="1" begin="3" end="3" resetval="0x0" description=" Enable (set) for intr_in[3]" range="3" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_2" width="1" begin="2" end="2" resetval="0x0" description=" Enable (set) for intr_in[2]" range="2" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_1" width="1" begin="1" end="1" resetval="0x0" description=" Enable (set) for intr_in[1]" range="1" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_0" width="1" begin="0" end="0" resetval="0x0" description=" Enable (set) for intr_in[0]" range="0" rwaccess="W1TS"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG1" offset="0x304" width="32" description="">
		<bitfield id="ENABLE_63" width="1" begin="31" end="31" resetval="0x0" description=" Enable (set) for intr_in[63]" range="31" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_62" width="1" begin="30" end="30" resetval="0x0" description=" Enable (set) for intr_in[62]" range="30" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_61" width="1" begin="29" end="29" resetval="0x0" description=" Enable (set) for intr_in[61]" range="29" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_60" width="1" begin="28" end="28" resetval="0x0" description=" Enable (set) for intr_in[60]" range="28" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_59" width="1" begin="27" end="27" resetval="0x0" description=" Enable (set) for intr_in[59]" range="27" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_58" width="1" begin="26" end="26" resetval="0x0" description=" Enable (set) for intr_in[58]" range="26" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_57" width="1" begin="25" end="25" resetval="0x0" description=" Enable (set) for intr_in[57]" range="25" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_56" width="1" begin="24" end="24" resetval="0x0" description=" Enable (set) for intr_in[56]" range="24" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_55" width="1" begin="23" end="23" resetval="0x0" description=" Enable (set) for intr_in[55]" range="23" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_54" width="1" begin="22" end="22" resetval="0x0" description=" Enable (set) for intr_in[54]" range="22" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_53" width="1" begin="21" end="21" resetval="0x0" description=" Enable (set) for intr_in[53]" range="21" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_52" width="1" begin="20" end="20" resetval="0x0" description=" Enable (set) for intr_in[52]" range="20" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_51" width="1" begin="19" end="19" resetval="0x0" description=" Enable (set) for intr_in[51]" range="19" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_50" width="1" begin="18" end="18" resetval="0x0" description=" Enable (set) for intr_in[50]" range="18" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_49" width="1" begin="17" end="17" resetval="0x0" description=" Enable (set) for intr_in[49]" range="17" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_48" width="1" begin="16" end="16" resetval="0x0" description=" Enable (set) for intr_in[48]" range="16" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_47" width="1" begin="15" end="15" resetval="0x0" description=" Enable (set) for intr_in[47]" range="15" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_46" width="1" begin="14" end="14" resetval="0x0" description=" Enable (set) for intr_in[46]" range="14" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_45" width="1" begin="13" end="13" resetval="0x0" description=" Enable (set) for intr_in[45]" range="13" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_44" width="1" begin="12" end="12" resetval="0x0" description=" Enable (set) for intr_in[44]" range="12" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_43" width="1" begin="11" end="11" resetval="0x0" description=" Enable (set) for intr_in[43]" range="11" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_42" width="1" begin="10" end="10" resetval="0x0" description=" Enable (set) for intr_in[42]" range="10" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_41" width="1" begin="9" end="9" resetval="0x0" description=" Enable (set) for intr_in[41]" range="9" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_40" width="1" begin="8" end="8" resetval="0x0" description=" Enable (set) for intr_in[40]" range="8" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_39" width="1" begin="7" end="7" resetval="0x0" description=" Enable (set) for intr_in[39]" range="7" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_38" width="1" begin="6" end="6" resetval="0x0" description=" Enable (set) for intr_in[38]" range="6" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_37" width="1" begin="5" end="5" resetval="0x0" description=" Enable (set) for intr_in[37]" range="5" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_36" width="1" begin="4" end="4" resetval="0x0" description=" Enable (set) for intr_in[36]" range="4" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_35" width="1" begin="3" end="3" resetval="0x0" description=" Enable (set) for intr_in[35]" range="3" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_34" width="1" begin="2" end="2" resetval="0x0" description=" Enable (set) for intr_in[34]" range="2" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_33" width="1" begin="1" end="1" resetval="0x0" description=" Enable (set) for intr_in[33]" range="1" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_32" width="1" begin="0" end="0" resetval="0x0" description=" Enable (set) for intr_in[32]" range="0" rwaccess="W1TS"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG2" offset="0x308" width="32" description="">
		<bitfield id="ENABLE_95" width="1" begin="31" end="31" resetval="0x0" description=" Enable (set) for slv_events_in[31]" range="31" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_94" width="1" begin="30" end="30" resetval="0x0" description=" Enable (set) for slv_events_in[30]" range="30" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_93" width="1" begin="29" end="29" resetval="0x0" description=" Enable (set) for slv_events_in[29]" range="29" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_92" width="1" begin="28" end="28" resetval="0x0" description=" Enable (set) for slv_events_in[28]" range="28" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_91" width="1" begin="27" end="27" resetval="0x0" description=" Enable (set) for slv_events_in[27]" range="27" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_90" width="1" begin="26" end="26" resetval="0x0" description=" Enable (set) for slv_events_in[26]" range="26" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_89" width="1" begin="25" end="25" resetval="0x0" description=" Enable (set) for slv_events_in[25]" range="25" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_88" width="1" begin="24" end="24" resetval="0x0" description=" Enable (set) for slv_events_in[24]" range="24" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_87" width="1" begin="23" end="23" resetval="0x0" description=" Enable (set) for slv_events_in[23]" range="23" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_86" width="1" begin="22" end="22" resetval="0x0" description=" Enable (set) for slv_events_in[22]" range="22" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_85" width="1" begin="21" end="21" resetval="0x0" description=" Enable (set) for slv_events_in[21]" range="21" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_84" width="1" begin="20" end="20" resetval="0x0" description=" Enable (set) for slv_events_in[20]" range="20" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_83" width="1" begin="19" end="19" resetval="0x0" description=" Enable (set) for slv_events_in[19]" range="19" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_82" width="1" begin="18" end="18" resetval="0x0" description=" Enable (set) for slv_events_in[18]" range="18" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_81" width="1" begin="17" end="17" resetval="0x0" description=" Enable (set) for slv_events_in[17]" range="17" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_80" width="1" begin="16" end="16" resetval="0x0" description=" Enable (set) for slv_events_in[16]" range="16" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_79" width="1" begin="15" end="15" resetval="0x0" description=" Enable (set) for slv_events_in[15]" range="15" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_78" width="1" begin="14" end="14" resetval="0x0" description=" Enable (set) for slv_events_in[14]" range="14" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_77" width="1" begin="13" end="13" resetval="0x0" description=" Enable (set) for slv_events_in[13]" range="13" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_76" width="1" begin="12" end="12" resetval="0x0" description=" Enable (set) for slv_events_in[12]" range="12" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_75" width="1" begin="11" end="11" resetval="0x0" description=" Enable (set) for slv_events_in[11]" range="11" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_74" width="1" begin="10" end="10" resetval="0x0" description=" Enable (set) for slv_events_in[10]" range="10" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_73" width="1" begin="9" end="9" resetval="0x0" description=" Enable (set) for slv_events_in[9]" range="9" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_72" width="1" begin="8" end="8" resetval="0x0" description=" Enable (set) for slv_events_in[8]" range="8" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_71" width="1" begin="7" end="7" resetval="0x0" description=" Enable (set) for slv_events_in[7]" range="7" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_70" width="1" begin="6" end="6" resetval="0x0" description=" Enable (set) for slv_events_in[6]" range="6" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_69" width="1" begin="5" end="5" resetval="0x0" description=" Enable (set) for slv_events_in[5]" range="5" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_68" width="1" begin="4" end="4" resetval="0x0" description=" Enable (set) for slv_events_in[4]" range="4" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_67" width="1" begin="3" end="3" resetval="0x0" description=" Enable (set) for slv_events_in[3]" range="3" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_66" width="1" begin="2" end="2" resetval="0x0" description=" Enable (set) for slv_events_in[2]" range="2" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_65" width="1" begin="1" end="1" resetval="0x0" description=" Enable (set) for slv_events_in[1]" range="1" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_64" width="1" begin="0" end="0" resetval="0x0" description=" Enable (set) for slv_events_in[0]" range="0" rwaccess="W1TS"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG3" offset="0x30C" width="32" description="">
		<bitfield id="ENABLE_127" width="1" begin="31" end="31" resetval="0x0" description=" Enable (set) for slv_events_in[63]" range="31" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_126" width="1" begin="30" end="30" resetval="0x0" description=" Enable (set) for slv_events_in[62]" range="30" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_125" width="1" begin="29" end="29" resetval="0x0" description=" Enable (set) for slv_events_in[61]" range="29" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_124" width="1" begin="28" end="28" resetval="0x0" description=" Enable (set) for slv_events_in[60]" range="28" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_123" width="1" begin="27" end="27" resetval="0x0" description=" Enable (set) for slv_events_in[59]" range="27" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_122" width="1" begin="26" end="26" resetval="0x0" description=" Enable (set) for slv_events_in[58]" range="26" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_121" width="1" begin="25" end="25" resetval="0x0" description=" Enable (set) for slv_events_in[57]" range="25" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_120" width="1" begin="24" end="24" resetval="0x0" description=" Enable (set) for slv_events_in[56]" range="24" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_119" width="1" begin="23" end="23" resetval="0x0" description=" Enable (set) for slv_events_in[55]" range="23" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_118" width="1" begin="22" end="22" resetval="0x0" description=" Enable (set) for slv_events_in[54]" range="22" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_117" width="1" begin="21" end="21" resetval="0x0" description=" Enable (set) for slv_events_in[53]" range="21" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_116" width="1" begin="20" end="20" resetval="0x0" description=" Enable (set) for slv_events_in[52]" range="20" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_115" width="1" begin="19" end="19" resetval="0x0" description=" Enable (set) for slv_events_in[51]" range="19" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_114" width="1" begin="18" end="18" resetval="0x0" description=" Enable (set) for slv_events_in[50]" range="18" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_113" width="1" begin="17" end="17" resetval="0x0" description=" Enable (set) for slv_events_in[49]" range="17" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_112" width="1" begin="16" end="16" resetval="0x0" description=" Enable (set) for slv_events_in[48]" range="16" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_111" width="1" begin="15" end="15" resetval="0x0" description=" Enable (set) for slv_events_in[47]" range="15" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_110" width="1" begin="14" end="14" resetval="0x0" description=" Enable (set) for slv_events_in[46]" range="14" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_109" width="1" begin="13" end="13" resetval="0x0" description=" Enable (set) for slv_events_in[45]" range="13" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_108" width="1" begin="12" end="12" resetval="0x0" description=" Enable (set) for slv_events_in[44]" range="12" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_107" width="1" begin="11" end="11" resetval="0x0" description=" Enable (set) for slv_events_in[43]" range="11" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_106" width="1" begin="10" end="10" resetval="0x0" description=" Enable (set) for slv_events_in[42]" range="10" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_105" width="1" begin="9" end="9" resetval="0x0" description=" Enable (set) for slv_events_in[41]" range="9" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_104" width="1" begin="8" end="8" resetval="0x0" description=" Enable (set) for slv_events_in[40]" range="8" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_103" width="1" begin="7" end="7" resetval="0x0" description=" Enable (set) for slv_events_in[39]" range="7" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_102" width="1" begin="6" end="6" resetval="0x0" description=" Enable (set) for slv_events_in[38]" range="6" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_101" width="1" begin="5" end="5" resetval="0x0" description=" Enable (set) for slv_events_in[37]" range="5" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_100" width="1" begin="4" end="4" resetval="0x0" description=" Enable (set) for slv_events_in[36]" range="4" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_99" width="1" begin="3" end="3" resetval="0x0" description=" Enable (set) for slv_events_in[35]" range="3" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_98" width="1" begin="2" end="2" resetval="0x0" description=" Enable (set) for slv_events_in[34]" range="2" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_97" width="1" begin="1" end="1" resetval="0x0" description=" Enable (set) for slv_events_in[33]" range="1" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_96" width="1" begin="0" end="0" resetval="0x0" description=" Enable (set) for slv_events_in[32]" range="0" rwaccess="W1TS"/>
	</register>
