ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_REG4" offset="0x310" width="32" description="">
		<bitfield id="ENABLE_159" width="1" begin="31" end="31" resetval="0x0" description=" Enable (set) for slv_events_in[95]" range="31" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_158" width="1" begin="30" end="30" resetval="0x0" description=" Enable (set) for slv_events_in[94]" range="30" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_157" width="1" begin="29" end="29" resetval="0x0" description=" Enable (set) for slv_events_in[93]" range="29" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_156" width="1" begin="28" end="28" resetval="0x0" description=" Enable (set) for slv_events_in[92]" range="28" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_155" width="1" begin="27" end="27" resetval="0x0" description=" Enable (set) for slv_events_in[91]" range="27" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_154" width="1" begin="26" end="26" resetval="0x0" description=" Enable (set) for slv_events_in[90]" range="26" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_153" width="1" begin="25" end="25" resetval="0x0" description=" Enable (set) for slv_events_in[89]" range="25" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_152" width="1" begin="24" end="24" resetval="0x0" description=" Enable (set) for slv_events_in[88]" range="24" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_151" width="1" begin="23" end="23" resetval="0x0" description=" Enable (set) for slv_events_in[87]" range="23" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_150" width="1" begin="22" end="22" resetval="0x0" description=" Enable (set) for slv_events_in[86]" range="22" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_149" width="1" begin="21" end="21" resetval="0x0" description=" Enable (set) for slv_events_in[85]" range="21" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_148" width="1" begin="20" end="20" resetval="0x0" description=" Enable (set) for slv_events_in[84]" range="20" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_147" width="1" begin="19" end="19" resetval="0x0" description=" Enable (set) for slv_events_in[83]" range="19" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_146" width="1" begin="18" end="18" resetval="0x0" description=" Enable (set) for slv_events_in[82]" range="18" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_145" width="1" begin="17" end="17" resetval="0x0" description=" Enable (set) for slv_events_in[81]" range="17" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_144" width="1" begin="16" end="16" resetval="0x0" description=" Enable (set) for slv_events_in[80]" range="16" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_143" width="1" begin="15" end="15" resetval="0x0" description=" Enable (set) for slv_events_in[79]" range="15" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_142" width="1" begin="14" end="14" resetval="0x0" description=" Enable (set) for slv_events_in[78]" range="14" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_141" width="1" begin="13" end="13" resetval="0x0" description=" Enable (set) for slv_events_in[77]" range="13" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_140" width="1" begin="12" end="12" resetval="0x0" description=" Enable (set) for slv_events_in[76]" range="12" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_139" width="1" begin="11" end="11" resetval="0x0" description=" Enable (set) for slv_events_in[75]" range="11" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_138" width="1" begin="10" end="10" resetval="0x0" description=" Enable (set) for slv_events_in[74]" range="10" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_137" width="1" begin="9" end="9" resetval="0x0" description=" Enable (set) for slv_events_in[73]" range="9" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_136" width="1" begin="8" end="8" resetval="0x0" description=" Enable (set) for slv_events_in[72]" range="8" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_135" width="1" begin="7" end="7" resetval="0x0" description=" Enable (set) for slv_events_in[71]" range="7" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_134" width="1" begin="6" end="6" resetval="0x0" description=" Enable (set) for slv_events_in[70]" range="6" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_133" width="1" begin="5" end="5" resetval="0x0" description=" Enable (set) for slv_events_in[69]" range="5" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_132" width="1" begin="4" end="4" resetval="0x0" description=" Enable (set) for slv_events_in[68]" range="4" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_131" width="1" begin="3" end="3" resetval="0x0" description=" Enable (set) for slv_events_in[67]" range="3" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_130" width="1" begin="2" end="2" resetval="0x0" description=" Enable (set) for slv_events_in[66]" range="2" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_129" width="1" begin="1" end="1" resetval="0x0" description=" Enable (set) for slv_events_in[65]" range="1" rwaccess="W1TS"/> 
		<bitfield id="ENABLE_128" width="1" begin="0" end="0" resetval="0x0" description=" Enable (set) for slv_events_in[64]" range="0" rwaccess="W1TS"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG0" offset="0x380" width="32" description="">
		<bitfield id="ENABLE_31_CLR" width="1" begin="31" end="31" resetval="0x0" description=" Enable clear for intr_in[31]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_30_CLR" width="1" begin="30" end="30" resetval="0x0" description=" Enable clear for intr_in[30]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_29_CLR" width="1" begin="29" end="29" resetval="0x0" description=" Enable clear for intr_in[29]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_28_CLR" width="1" begin="28" end="28" resetval="0x0" description=" Enable clear for intr_in[28]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_27_CLR" width="1" begin="27" end="27" resetval="0x0" description=" Enable clear for intr_in[27]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_26_CLR" width="1" begin="26" end="26" resetval="0x0" description=" Enable clear for intr_in[26]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_25_CLR" width="1" begin="25" end="25" resetval="0x0" description=" Enable clear for intr_in[25]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_24_CLR" width="1" begin="24" end="24" resetval="0x0" description=" Enable clear for intr_in[24]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_23_CLR" width="1" begin="23" end="23" resetval="0x0" description=" Enable clear for intr_in[23]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_22_CLR" width="1" begin="22" end="22" resetval="0x0" description=" Enable clear for intr_in[22]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_21_CLR" width="1" begin="21" end="21" resetval="0x0" description=" Enable clear for intr_in[21]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_20_CLR" width="1" begin="20" end="20" resetval="0x0" description=" Enable clear for intr_in[20]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_19_CLR" width="1" begin="19" end="19" resetval="0x0" description=" Enable clear for intr_in[19]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_18_CLR" width="1" begin="18" end="18" resetval="0x0" description=" Enable clear for intr_in[18]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_17_CLR" width="1" begin="17" end="17" resetval="0x0" description=" Enable clear for intr_in[17]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_16_CLR" width="1" begin="16" end="16" resetval="0x0" description=" Enable clear for intr_in[16]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_15_CLR" width="1" begin="15" end="15" resetval="0x0" description=" Enable clear for intr_in[15]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_14_CLR" width="1" begin="14" end="14" resetval="0x0" description=" Enable clear for intr_in[14]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_13_CLR" width="1" begin="13" end="13" resetval="0x0" description=" Enable clear for intr_in[13]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_12_CLR" width="1" begin="12" end="12" resetval="0x0" description=" Enable clear for intr_in[12]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_11_CLR" width="1" begin="11" end="11" resetval="0x0" description=" Enable clear for intr_in[11]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_10_CLR" width="1" begin="10" end="10" resetval="0x0" description=" Enable clear for intr_in[10]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_9_CLR" width="1" begin="9" end="9" resetval="0x0" description=" Enable clear for intr_in[9]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_8_CLR" width="1" begin="8" end="8" resetval="0x0" description=" Enable clear for intr_in[8]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_7_CLR" width="1" begin="7" end="7" resetval="0x0" description=" Enable clear for intr_in[7]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_6_CLR" width="1" begin="6" end="6" resetval="0x0" description=" Enable clear for intr_in[6]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_5_CLR" width="1" begin="5" end="5" resetval="0x0" description=" Enable clear for intr_in[5]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_4_CLR" width="1" begin="4" end="4" resetval="0x0" description=" Enable clear for intr_in[4]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_3_CLR" width="1" begin="3" end="3" resetval="0x0" description=" Enable clear for intr_in[3]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_2_CLR" width="1" begin="2" end="2" resetval="0x0" description=" Enable clear for intr_in[2]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_1_CLR" width="1" begin="1" end="1" resetval="0x0" description=" Enable clear for intr_in[1]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_0_CLR" width="1" begin="0" end="0" resetval="0x0" description=" Enable clear for intr_in[0]" range="0" rwaccess="W1TC"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG1" offset="0x384" width="32" description="">
		<bitfield id="ENABLE_63_CLR" width="1" begin="31" end="31" resetval="0x0" description=" Enable clear for intr_in[63]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_62_CLR" width="1" begin="30" end="30" resetval="0x0" description=" Enable clear for intr_in[62]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_61_CLR" width="1" begin="29" end="29" resetval="0x0" description=" Enable clear for intr_in[61]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_60_CLR" width="1" begin="28" end="28" resetval="0x0" description=" Enable clear for intr_in[60]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_59_CLR" width="1" begin="27" end="27" resetval="0x0" description=" Enable clear for intr_in[59]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_58_CLR" width="1" begin="26" end="26" resetval="0x0" description=" Enable clear for intr_in[58]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_57_CLR" width="1" begin="25" end="25" resetval="0x0" description=" Enable clear for intr_in[57]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_56_CLR" width="1" begin="24" end="24" resetval="0x0" description=" Enable clear for intr_in[56]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_55_CLR" width="1" begin="23" end="23" resetval="0x0" description=" Enable clear for intr_in[55]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_54_CLR" width="1" begin="22" end="22" resetval="0x0" description=" Enable clear for intr_in[54]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_53_CLR" width="1" begin="21" end="21" resetval="0x0" description=" Enable clear for intr_in[53]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_52_CLR" width="1" begin="20" end="20" resetval="0x0" description=" Enable clear for intr_in[52]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_51_CLR" width="1" begin="19" end="19" resetval="0x0" description=" Enable clear for intr_in[51]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_50_CLR" width="1" begin="18" end="18" resetval="0x0" description=" Enable clear for intr_in[50]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_49_CLR" width="1" begin="17" end="17" resetval="0x0" description=" Enable clear for intr_in[49]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_48_CLR" width="1" begin="16" end="16" resetval="0x0" description=" Enable clear for intr_in[48]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_47_CLR" width="1" begin="15" end="15" resetval="0x0" description=" Enable clear for intr_in[47]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_46_CLR" width="1" begin="14" end="14" resetval="0x0" description=" Enable clear for intr_in[46]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_45_CLR" width="1" begin="13" end="13" resetval="0x0" description=" Enable clear for intr_in[45]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_44_CLR" width="1" begin="12" end="12" resetval="0x0" description=" Enable clear for intr_in[44]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_43_CLR" width="1" begin="11" end="11" resetval="0x0" description=" Enable clear for intr_in[43]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_42_CLR" width="1" begin="10" end="10" resetval="0x0" description=" Enable clear for intr_in[42]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_41_CLR" width="1" begin="9" end="9" resetval="0x0" description=" Enable clear for intr_in[41]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_40_CLR" width="1" begin="8" end="8" resetval="0x0" description=" Enable clear for intr_in[40]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_39_CLR" width="1" begin="7" end="7" resetval="0x0" description=" Enable clear for intr_in[39]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_38_CLR" width="1" begin="6" end="6" resetval="0x0" description=" Enable clear for intr_in[38]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_37_CLR" width="1" begin="5" end="5" resetval="0x0" description=" Enable clear for intr_in[37]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_36_CLR" width="1" begin="4" end="4" resetval="0x0" description=" Enable clear for intr_in[36]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_35_CLR" width="1" begin="3" end="3" resetval="0x0" description=" Enable clear for intr_in[35]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_34_CLR" width="1" begin="2" end="2" resetval="0x0" description=" Enable clear for intr_in[34]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_33_CLR" width="1" begin="1" end="1" resetval="0x0" description=" Enable clear for intr_in[33]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_32_CLR" width="1" begin="0" end="0" resetval="0x0" description=" Enable clear for intr_in[32]" range="0" rwaccess="W1TC"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG2" offset="0x388" width="32" description="">
		<bitfield id="ENABLE_95_CLR" width="1" begin="31" end="31" resetval="0x0" description=" Enable clear for slv_events_in[31]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_94_CLR" width="1" begin="30" end="30" resetval="0x0" description=" Enable clear for slv_events_in[30]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_93_CLR" width="1" begin="29" end="29" resetval="0x0" description=" Enable clear for slv_events_in[29]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_92_CLR" width="1" begin="28" end="28" resetval="0x0" description=" Enable clear for slv_events_in[28]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_91_CLR" width="1" begin="27" end="27" resetval="0x0" description=" Enable clear for slv_events_in[27]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_90_CLR" width="1" begin="26" end="26" resetval="0x0" description=" Enable clear for slv_events_in[26]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_89_CLR" width="1" begin="25" end="25" resetval="0x0" description=" Enable clear for slv_events_in[25]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_88_CLR" width="1" begin="24" end="24" resetval="0x0" description=" Enable clear for slv_events_in[24]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_87_CLR" width="1" begin="23" end="23" resetval="0x0" description=" Enable clear for slv_events_in[23]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_86_CLR" width="1" begin="22" end="22" resetval="0x0" description=" Enable clear for slv_events_in[22]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_85_CLR" width="1" begin="21" end="21" resetval="0x0" description=" Enable clear for slv_events_in[21]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_84_CLR" width="1" begin="20" end="20" resetval="0x0" description=" Enable clear for slv_events_in[20]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_83_CLR" width="1" begin="19" end="19" resetval="0x0" description=" Enable clear for slv_events_in[19]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_82_CLR" width="1" begin="18" end="18" resetval="0x0" description=" Enable clear for slv_events_in[18]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_81_CLR" width="1" begin="17" end="17" resetval="0x0" description=" Enable clear for slv_events_in[17]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_80_CLR" width="1" begin="16" end="16" resetval="0x0" description=" Enable clear for slv_events_in[16]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_79_CLR" width="1" begin="15" end="15" resetval="0x0" description=" Enable clear for slv_events_in[15]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_78_CLR" width="1" begin="14" end="14" resetval="0x0" description=" Enable clear for slv_events_in[14]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_77_CLR" width="1" begin="13" end="13" resetval="0x0" description=" Enable clear for slv_events_in[13]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_76_CLR" width="1" begin="12" end="12" resetval="0x0" description=" Enable clear for slv_events_in[12]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_75_CLR" width="1" begin="11" end="11" resetval="0x0" description=" Enable clear for slv_events_in[11]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_74_CLR" width="1" begin="10" end="10" resetval="0x0" description=" Enable clear for slv_events_in[10]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_73_CLR" width="1" begin="9" end="9" resetval="0x0" description=" Enable clear for slv_events_in[9]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_72_CLR" width="1" begin="8" end="8" resetval="0x0" description=" Enable clear for slv_events_in[8]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_71_CLR" width="1" begin="7" end="7" resetval="0x0" description=" Enable clear for slv_events_in[7]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_70_CLR" width="1" begin="6" end="6" resetval="0x0" description=" Enable clear for slv_events_in[6]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_69_CLR" width="1" begin="5" end="5" resetval="0x0" description=" Enable clear for slv_events_in[5]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_68_CLR" width="1" begin="4" end="4" resetval="0x0" description=" Enable clear for slv_events_in[4]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_67_CLR" width="1" begin="3" end="3" resetval="0x0" description=" Enable clear for slv_events_in[3]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_66_CLR" width="1" begin="2" end="2" resetval="0x0" description=" Enable clear for slv_events_in[2]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_65_CLR" width="1" begin="1" end="1" resetval="0x0" description=" Enable clear for slv_events_in[1]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_64_CLR" width="1" begin="0" end="0" resetval="0x0" description=" Enable clear for slv_events_in[0]" range="0" rwaccess="W1TC"/>
	</register>
