ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG33" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG33" offset="0x484" width="32" description="">
		<bitfield id="CH_MAP_135" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[71]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_134" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[70]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_133" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[69]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_132" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[68]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG34" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG34" offset="0x488" width="32" description="">
		<bitfield id="CH_MAP_139" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[75]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_138" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[74]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_137" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[73]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_136" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[72]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG35" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG35" offset="0x48C" width="32" description="">
		<bitfield id="CH_MAP_143" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[79]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_142" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[78]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_141" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[77]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_140" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[76]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG36" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG36" offset="0x490" width="32" description="">
		<bitfield id="CH_MAP_147" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[83]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_146" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[82]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_145" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[81]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_144" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[80]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG37" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG37" offset="0x494" width="32" description="">
		<bitfield id="CH_MAP_151" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[87]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_150" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[86]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_149" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[85]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_148" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[84]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG38" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG38" offset="0x498" width="32" description="">
		<bitfield id="CH_MAP_155" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[91]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_154" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[90]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_153" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[89]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_152" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[88]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG39" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG39" offset="0x49C" width="32" description="">
		<bitfield id="CH_MAP_159" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[95]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_158" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[94]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_157" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[93]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_156" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[92]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG0" offset="0x800" width="32" description="">
		<bitfield id="HINT_MAP_3" width="5" begin="28" end="24" resetval="0x0" description=" Host Interrupt Map for Channel 3" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_2" width="5" begin="20" end="16" resetval="0x0" description=" Host Interrupt Map for Channel 2" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_1" width="5" begin="12" end="8" resetval="0x0" description=" Host Interrupt Map for Channel 1" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_0" width="5" begin="4" end="0" resetval="0x0" description=" Host Interrupt Map for Channel 0" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG1" offset="0x804" width="32" description="">
		<bitfield id="HINT_MAP_7" width="5" begin="28" end="24" resetval="0x0" description=" Host Interrupt Map for Channel 7" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_6" width="5" begin="20" end="16" resetval="0x0" description=" Host Interrupt Map for Channel 6" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_5" width="5" begin="12" end="8" resetval="0x0" description=" Host Interrupt Map for Channel 5" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_4" width="5" begin="4" end="0" resetval="0x0" description=" Host Interrupt Map for Channel 4" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG2" offset="0x808" width="32" description="">
		<bitfield id="HINT_MAP_11" width="5" begin="28" end="24" resetval="0x0" description=" Host Interrupt Map for Channel 11" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_10" width="5" begin="20" end="16" resetval="0x0" description=" Host Interrupt Map for Channel 10" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_9" width="5" begin="12" end="8" resetval="0x0" description=" Host Interrupt Map for Channel 9" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_8" width="5" begin="4" end="0" resetval="0x0" description=" Host Interrupt Map for Channel 8" range="4 - 0" rwaccess="R/W"/>
	</register>
