ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG11" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG11" offset="0x92C" width="32" description="">
		<bitfield id="NONE_HINT_11" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_11" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 11 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG12" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG12" offset="0x930" width="32" description="">
		<bitfield id="NONE_HINT_12" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_12" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 12 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG13" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG13" offset="0x934" width="32" description="">
		<bitfield id="NONE_HINT_13" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_13" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 13 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG14" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG14" offset="0x938" width="32" description="">
		<bitfield id="NONE_HINT_14" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_14" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 14 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG15" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG15" offset="0x93C" width="32" description="">
		<bitfield id="NONE_HINT_15" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_15" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 15 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG16" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG16" offset="0x940" width="32" description="">
		<bitfield id="NONE_HINT_16" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_16" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 16 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG17" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG17" offset="0x944" width="32" description="">
		<bitfield id="NONE_HINT_17" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_17" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 17 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG18" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG18" offset="0x948" width="32" description="">
		<bitfield id="NONE_HINT_18" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_18" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 18 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG19" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG19" offset="0x94C" width="32" description="">
		<bitfield id="NONE_HINT_19" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_19" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 19 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG0" offset="0xD00" width="32" description="">
		<bitfield id="POLARITY_31" width="1" begin="31" end="31" resetval="0x1" description=" Polarity for intr_in[31] 0=low" range="31" rwaccess="R/W"/> 
		<bitfield id="POLARITY_30" width="1" begin="30" end="30" resetval="0x1" description=" Polarity for intr_in[30] 0=low" range="30" rwaccess="R/W"/> 
		<bitfield id="POLARITY_29" width="1" begin="29" end="29" resetval="0x1" description=" Polarity for intr_in[29] 0=low" range="29" rwaccess="R/W"/> 
		<bitfield id="POLARITY_28" width="1" begin="28" end="28" resetval="0x1" description=" Polarity for intr_in[28] 0=low" range="28" rwaccess="R/W"/> 
		<bitfield id="POLARITY_27" width="1" begin="27" end="27" resetval="0x1" description=" Polarity for intr_in[27] 0=low" range="27" rwaccess="R/W"/> 
		<bitfield id="POLARITY_26" width="1" begin="26" end="26" resetval="0x1" description=" Polarity for intr_in[26] 0=low" range="26" rwaccess="R/W"/> 
		<bitfield id="POLARITY_25" width="1" begin="25" end="25" resetval="0x1" description=" Polarity for intr_in[25] 0=low" range="25" rwaccess="R/W"/> 
		<bitfield id="POLARITY_24" width="1" begin="24" end="24" resetval="0x1" description=" Polarity for intr_in[24] 0=low" range="24" rwaccess="R/W"/> 
		<bitfield id="POLARITY_23" width="1" begin="23" end="23" resetval="0x1" description=" Polarity for intr_in[23] 0=low" range="23" rwaccess="R/W"/> 
		<bitfield id="POLARITY_22" width="1" begin="22" end="22" resetval="0x1" description=" Polarity for intr_in[22] 0=low" range="22" rwaccess="R/W"/> 
		<bitfield id="POLARITY_21" width="1" begin="21" end="21" resetval="0x1" description=" Polarity for intr_in[21] 0=low" range="21" rwaccess="R/W"/> 
		<bitfield id="POLARITY_20" width="1" begin="20" end="20" resetval="0x1" description=" Polarity for intr_in[20] 0=low" range="20" rwaccess="R/W"/> 
		<bitfield id="POLARITY_19" width="1" begin="19" end="19" resetval="0x1" description=" Polarity for intr_in[19] 0=low" range="19" rwaccess="R/W"/> 
		<bitfield id="POLARITY_18" width="1" begin="18" end="18" resetval="0x1" description=" Polarity for intr_in[18] 0=low" range="18" rwaccess="R/W"/> 
		<bitfield id="POLARITY_17" width="1" begin="17" end="17" resetval="0x1" description=" Polarity for intr_in[17] 0=low" range="17" rwaccess="R/W"/> 
		<bitfield id="POLARITY_16" width="1" begin="16" end="16" resetval="0x1" description=" Polarity for intr_in[16] 0=low" range="16" rwaccess="R/W"/> 
		<bitfield id="POLARITY_15" width="1" begin="15" end="15" resetval="0x1" description=" Polarity for intr_in[15] 0=low" range="15" rwaccess="R/W"/> 
		<bitfield id="POLARITY_14" width="1" begin="14" end="14" resetval="0x1" description=" Polarity for intr_in[14] 0=low" range="14" rwaccess="R/W"/> 
		<bitfield id="POLARITY_13" width="1" begin="13" end="13" resetval="0x1" description=" Polarity for intr_in[13] 0=low" range="13" rwaccess="R/W"/> 
		<bitfield id="POLARITY_12" width="1" begin="12" end="12" resetval="0x1" description=" Polarity for intr_in[12] 0=low" range="12" rwaccess="R/W"/> 
		<bitfield id="POLARITY_11" width="1" begin="11" end="11" resetval="0x1" description=" Polarity for intr_in[11] 0=low" range="11" rwaccess="R/W"/> 
		<bitfield id="POLARITY_10" width="1" begin="10" end="10" resetval="0x1" description=" Polarity for intr_in[10] 0=low" range="10" rwaccess="R/W"/> 
		<bitfield id="POLARITY_9" width="1" begin="9" end="9" resetval="0x1" description=" Polarity for intr_in[9] 0=low" range="9" rwaccess="R/W"/> 
		<bitfield id="POLARITY_8" width="1" begin="8" end="8" resetval="0x1" description=" Polarity for intr_in[8] 0=low" range="8" rwaccess="R/W"/> 
		<bitfield id="POLARITY_7" width="1" begin="7" end="7" resetval="0x1" description=" Polarity for intr_in[7] 0=low" range="7" rwaccess="R/W"/> 
		<bitfield id="POLARITY_6" width="1" begin="6" end="6" resetval="0x1" description=" Polarity for intr_in[6] 0=low" range="6" rwaccess="R/W"/> 
		<bitfield id="POLARITY_5" width="1" begin="5" end="5" resetval="0x1" description=" Polarity for intr_in[5] 0=low" range="5" rwaccess="R/W"/> 
		<bitfield id="POLARITY_4" width="1" begin="4" end="4" resetval="0x1" description=" Polarity for intr_in[4] 0=low" range="4" rwaccess="R/W"/> 
		<bitfield id="POLARITY_3" width="1" begin="3" end="3" resetval="0x1" description=" Polarity for intr_in[3] 0=low" range="3" rwaccess="R/W"/> 
		<bitfield id="POLARITY_2" width="1" begin="2" end="2" resetval="0x1" description=" Polarity for intr_in[2] 0=low" range="2" rwaccess="R/W"/> 
		<bitfield id="POLARITY_1" width="1" begin="1" end="1" resetval="0x1" description=" Polarity for intr_in[1] 0=low" range="1" rwaccess="R/W"/> 
		<bitfield id="POLARITY_0" width="1" begin="0" end="0" resetval="0x1" description=" Polarity for intr_in[0] 0=low" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG1" offset="0xD04" width="32" description="">
		<bitfield id="POLARITY_63" width="1" begin="31" end="31" resetval="0x1" description=" Polarity for intr_in[63] 0=low" range="31" rwaccess="R/W"/> 
		<bitfield id="POLARITY_62" width="1" begin="30" end="30" resetval="0x1" description=" Polarity for intr_in[62] 0=low" range="30" rwaccess="R/W"/> 
		<bitfield id="POLARITY_61" width="1" begin="29" end="29" resetval="0x1" description=" Polarity for intr_in[61] 0=low" range="29" rwaccess="R/W"/> 
		<bitfield id="POLARITY_60" width="1" begin="28" end="28" resetval="0x1" description=" Polarity for intr_in[60] 0=low" range="28" rwaccess="R/W"/> 
		<bitfield id="POLARITY_59" width="1" begin="27" end="27" resetval="0x1" description=" Polarity for intr_in[59] 0=low" range="27" rwaccess="R/W"/> 
		<bitfield id="POLARITY_58" width="1" begin="26" end="26" resetval="0x1" description=" Polarity for intr_in[58] 0=low" range="26" rwaccess="R/W"/> 
		<bitfield id="POLARITY_57" width="1" begin="25" end="25" resetval="0x1" description=" Polarity for intr_in[57] 0=low" range="25" rwaccess="R/W"/> 
		<bitfield id="POLARITY_56" width="1" begin="24" end="24" resetval="0x1" description=" Polarity for intr_in[56] 0=low" range="24" rwaccess="R/W"/> 
		<bitfield id="POLARITY_55" width="1" begin="23" end="23" resetval="0x1" description=" Polarity for intr_in[55] 0=low" range="23" rwaccess="R/W"/> 
		<bitfield id="POLARITY_54" width="1" begin="22" end="22" resetval="0x1" description=" Polarity for intr_in[54] 0=low" range="22" rwaccess="R/W"/> 
		<bitfield id="POLARITY_53" width="1" begin="21" end="21" resetval="0x1" description=" Polarity for intr_in[53] 0=low" range="21" rwaccess="R/W"/> 
		<bitfield id="POLARITY_52" width="1" begin="20" end="20" resetval="0x1" description=" Polarity for intr_in[52] 0=low" range="20" rwaccess="R/W"/> 
		<bitfield id="POLARITY_51" width="1" begin="19" end="19" resetval="0x1" description=" Polarity for intr_in[51] 0=low" range="19" rwaccess="R/W"/> 
		<bitfield id="POLARITY_50" width="1" begin="18" end="18" resetval="0x1" description=" Polarity for intr_in[50] 0=low" range="18" rwaccess="R/W"/> 
		<bitfield id="POLARITY_49" width="1" begin="17" end="17" resetval="0x1" description=" Polarity for intr_in[49] 0=low" range="17" rwaccess="R/W"/> 
		<bitfield id="POLARITY_48" width="1" begin="16" end="16" resetval="0x1" description=" Polarity for intr_in[48] 0=low" range="16" rwaccess="R/W"/> 
		<bitfield id="POLARITY_47" width="1" begin="15" end="15" resetval="0x1" description=" Polarity for intr_in[47] 0=low" range="15" rwaccess="R/W"/> 
		<bitfield id="POLARITY_46" width="1" begin="14" end="14" resetval="0x1" description=" Polarity for intr_in[46] 0=low" range="14" rwaccess="R/W"/> 
		<bitfield id="POLARITY_45" width="1" begin="13" end="13" resetval="0x1" description=" Polarity for intr_in[45] 0=low" range="13" rwaccess="R/W"/> 
		<bitfield id="POLARITY_44" width="1" begin="12" end="12" resetval="0x1" description=" Polarity for intr_in[44] 0=low" range="12" rwaccess="R/W"/> 
		<bitfield id="POLARITY_43" width="1" begin="11" end="11" resetval="0x1" description=" Polarity for intr_in[43] 0=low" range="11" rwaccess="R/W"/> 
		<bitfield id="POLARITY_42" width="1" begin="10" end="10" resetval="0x1" description=" Polarity for intr_in[42] 0=low" range="10" rwaccess="R/W"/> 
		<bitfield id="POLARITY_41" width="1" begin="9" end="9" resetval="0x1" description=" Polarity for intr_in[41] 0=low" range="9" rwaccess="R/W"/> 
		<bitfield id="POLARITY_40" width="1" begin="8" end="8" resetval="0x1" description=" Polarity for intr_in[40] 0=low" range="8" rwaccess="R/W"/> 
		<bitfield id="POLARITY_39" width="1" begin="7" end="7" resetval="0x1" description=" Polarity for intr_in[39] 0=low" range="7" rwaccess="R/W"/> 
		<bitfield id="POLARITY_38" width="1" begin="6" end="6" resetval="0x1" description=" Polarity for intr_in[38] 0=low" range="6" rwaccess="R/W"/> 
		<bitfield id="POLARITY_37" width="1" begin="5" end="5" resetval="0x1" description=" Polarity for intr_in[37] 0=low" range="5" rwaccess="R/W"/> 
		<bitfield id="POLARITY_36" width="1" begin="4" end="4" resetval="0x1" description=" Polarity for intr_in[36] 0=low" range="4" rwaccess="R/W"/> 
		<bitfield id="POLARITY_35" width="1" begin="3" end="3" resetval="0x1" description=" Polarity for intr_in[35] 0=low" range="3" rwaccess="R/W"/> 
		<bitfield id="POLARITY_34" width="1" begin="2" end="2" resetval="0x1" description=" Polarity for intr_in[34] 0=low" range="2" rwaccess="R/W"/> 
		<bitfield id="POLARITY_33" width="1" begin="1" end="1" resetval="0x1" description=" Polarity for intr_in[33] 0=low" range="1" rwaccess="R/W"/> 
		<bitfield id="POLARITY_32" width="1" begin="0" end="0" resetval="0x1" description=" Polarity for intr_in[32] 0=low" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG2" offset="0xD08" width="32" description="">
		<bitfield id="POLARITY_95" width="1" begin="31" end="31" resetval="0x1" description=" Polarity for slv_events_in[31] 0=low" range="31" rwaccess="R/W"/> 
		<bitfield id="POLARITY_94" width="1" begin="30" end="30" resetval="0x1" description=" Polarity for slv_events_in[30] 0=low" range="30" rwaccess="R/W"/> 
		<bitfield id="POLARITY_93" width="1" begin="29" end="29" resetval="0x1" description=" Polarity for slv_events_in[29] 0=low" range="29" rwaccess="R/W"/> 
		<bitfield id="POLARITY_92" width="1" begin="28" end="28" resetval="0x1" description=" Polarity for slv_events_in[28] 0=low" range="28" rwaccess="R/W"/> 
		<bitfield id="POLARITY_91" width="1" begin="27" end="27" resetval="0x1" description=" Polarity for slv_events_in[27] 0=low" range="27" rwaccess="R/W"/> 
		<bitfield id="POLARITY_90" width="1" begin="26" end="26" resetval="0x1" description=" Polarity for slv_events_in[26] 0=low" range="26" rwaccess="R/W"/> 
		<bitfield id="POLARITY_89" width="1" begin="25" end="25" resetval="0x1" description=" Polarity for slv_events_in[25] 0=low" range="25" rwaccess="R/W"/> 
		<bitfield id="POLARITY_88" width="1" begin="24" end="24" resetval="0x1" description=" Polarity for slv_events_in[24] 0=low" range="24" rwaccess="R/W"/> 
		<bitfield id="POLARITY_87" width="1" begin="23" end="23" resetval="0x1" description=" Polarity for slv_events_in[23] 0=low" range="23" rwaccess="R/W"/> 
		<bitfield id="POLARITY_86" width="1" begin="22" end="22" resetval="0x1" description=" Polarity for slv_events_in[22] 0=low" range="22" rwaccess="R/W"/> 
		<bitfield id="POLARITY_85" width="1" begin="21" end="21" resetval="0x1" description=" Polarity for slv_events_in[21] 0=low" range="21" rwaccess="R/W"/> 
		<bitfield id="POLARITY_84" width="1" begin="20" end="20" resetval="0x1" description=" Polarity for slv_events_in[20] 0=low" range="20" rwaccess="R/W"/> 
		<bitfield id="POLARITY_83" width="1" begin="19" end="19" resetval="0x1" description=" Polarity for slv_events_in[19] 0=low" range="19" rwaccess="R/W"/> 
		<bitfield id="POLARITY_82" width="1" begin="18" end="18" resetval="0x1" description=" Polarity for slv_events_in[18] 0=low" range="18" rwaccess="R/W"/> 
		<bitfield id="POLARITY_81" width="1" begin="17" end="17" resetval="0x1" description=" Polarity for slv_events_in[17] 0=low" range="17" rwaccess="R/W"/> 
		<bitfield id="POLARITY_80" width="1" begin="16" end="16" resetval="0x1" description=" Polarity for slv_events_in[16] 0=low" range="16" rwaccess="R/W"/> 
		<bitfield id="POLARITY_79" width="1" begin="15" end="15" resetval="0x1" description=" Polarity for slv_events_in[15] 0=low" range="15" rwaccess="R/W"/> 
		<bitfield id="POLARITY_78" width="1" begin="14" end="14" resetval="0x1" description=" Polarity for slv_events_in[14] 0=low" range="14" rwaccess="R/W"/> 
		<bitfield id="POLARITY_77" width="1" begin="13" end="13" resetval="0x1" description=" Polarity for slv_events_in[13] 0=low" range="13" rwaccess="R/W"/> 
		<bitfield id="POLARITY_76" width="1" begin="12" end="12" resetval="0x1" description=" Polarity for slv_events_in[12] 0=low" range="12" rwaccess="R/W"/> 
		<bitfield id="POLARITY_75" width="1" begin="11" end="11" resetval="0x1" description=" Polarity for slv_events_in[11] 0=low" range="11" rwaccess="R/W"/> 
		<bitfield id="POLARITY_74" width="1" begin="10" end="10" resetval="0x1" description=" Polarity for slv_events_in[10] 0=low" range="10" rwaccess="R/W"/> 
		<bitfield id="POLARITY_73" width="1" begin="9" end="9" resetval="0x1" description=" Polarity for slv_events_in[9] 0=low" range="9" rwaccess="R/W"/> 
		<bitfield id="POLARITY_72" width="1" begin="8" end="8" resetval="0x1" description=" Polarity for slv_events_in[8] 0=low" range="8" rwaccess="R/W"/> 
		<bitfield id="POLARITY_71" width="1" begin="7" end="7" resetval="0x1" description=" Polarity for slv_events_in[7] 0=low" range="7" rwaccess="R/W"/> 
		<bitfield id="POLARITY_70" width="1" begin="6" end="6" resetval="0x1" description=" Polarity for slv_events_in[6] 0=low" range="6" rwaccess="R/W"/> 
		<bitfield id="POLARITY_69" width="1" begin="5" end="5" resetval="0x1" description=" Polarity for slv_events_in[5] 0=low" range="5" rwaccess="R/W"/> 
		<bitfield id="POLARITY_68" width="1" begin="4" end="4" resetval="0x1" description=" Polarity for slv_events_in[4] 0=low" range="4" rwaccess="R/W"/> 
		<bitfield id="POLARITY_67" width="1" begin="3" end="3" resetval="0x1" description=" Polarity for slv_events_in[3] 0=low" range="3" rwaccess="R/W"/> 
		<bitfield id="POLARITY_66" width="1" begin="2" end="2" resetval="0x1" description=" Polarity for slv_events_in[2] 0=low" range="2" rwaccess="R/W"/> 
		<bitfield id="POLARITY_65" width="1" begin="1" end="1" resetval="0x1" description=" Polarity for slv_events_in[1] 0=low" range="1" rwaccess="R/W"/> 
		<bitfield id="POLARITY_64" width="1" begin="0" end="0" resetval="0x1" description=" Polarity for slv_events_in[0] 0=low" range="0" rwaccess="R/W"/>
	</register>
