ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG3" offset="0xD0C" width="32" description="">
		<bitfield id="POLARITY_127" width="1" begin="31" end="31" resetval="0x1" description=" Polarity for slv_events_in[63] 0=low" range="31" rwaccess="R/W"/> 
		<bitfield id="POLARITY_126" width="1" begin="30" end="30" resetval="0x1" description=" Polarity for slv_events_in[62] 0=low" range="30" rwaccess="R/W"/> 
		<bitfield id="POLARITY_125" width="1" begin="29" end="29" resetval="0x1" description=" Polarity for slv_events_in[61] 0=low" range="29" rwaccess="R/W"/> 
		<bitfield id="POLARITY_124" width="1" begin="28" end="28" resetval="0x1" description=" Polarity for slv_events_in[60] 0=low" range="28" rwaccess="R/W"/> 
		<bitfield id="POLARITY_123" width="1" begin="27" end="27" resetval="0x1" description=" Polarity for slv_events_in[59] 0=low" range="27" rwaccess="R/W"/> 
		<bitfield id="POLARITY_122" width="1" begin="26" end="26" resetval="0x1" description=" Polarity for slv_events_in[58] 0=low" range="26" rwaccess="R/W"/> 
		<bitfield id="POLARITY_121" width="1" begin="25" end="25" resetval="0x1" description=" Polarity for slv_events_in[57] 0=low" range="25" rwaccess="R/W"/> 
		<bitfield id="POLARITY_120" width="1" begin="24" end="24" resetval="0x1" description=" Polarity for slv_events_in[56] 0=low" range="24" rwaccess="R/W"/> 
		<bitfield id="POLARITY_119" width="1" begin="23" end="23" resetval="0x1" description=" Polarity for slv_events_in[55] 0=low" range="23" rwaccess="R/W"/> 
		<bitfield id="POLARITY_118" width="1" begin="22" end="22" resetval="0x1" description=" Polarity for slv_events_in[54] 0=low" range="22" rwaccess="R/W"/> 
		<bitfield id="POLARITY_117" width="1" begin="21" end="21" resetval="0x1" description=" Polarity for slv_events_in[53] 0=low" range="21" rwaccess="R/W"/> 
		<bitfield id="POLARITY_116" width="1" begin="20" end="20" resetval="0x1" description=" Polarity for slv_events_in[52] 0=low" range="20" rwaccess="R/W"/> 
		<bitfield id="POLARITY_115" width="1" begin="19" end="19" resetval="0x1" description=" Polarity for slv_events_in[51] 0=low" range="19" rwaccess="R/W"/> 
		<bitfield id="POLARITY_114" width="1" begin="18" end="18" resetval="0x1" description=" Polarity for slv_events_in[50] 0=low" range="18" rwaccess="R/W"/> 
		<bitfield id="POLARITY_113" width="1" begin="17" end="17" resetval="0x1" description=" Polarity for slv_events_in[49] 0=low" range="17" rwaccess="R/W"/> 
		<bitfield id="POLARITY_112" width="1" begin="16" end="16" resetval="0x1" description=" Polarity for slv_events_in[48] 0=low" range="16" rwaccess="R/W"/> 
		<bitfield id="POLARITY_111" width="1" begin="15" end="15" resetval="0x1" description=" Polarity for slv_events_in[47] 0=low" range="15" rwaccess="R/W"/> 
		<bitfield id="POLARITY_110" width="1" begin="14" end="14" resetval="0x1" description=" Polarity for slv_events_in[46] 0=low" range="14" rwaccess="R/W"/> 
		<bitfield id="POLARITY_109" width="1" begin="13" end="13" resetval="0x1" description=" Polarity for slv_events_in[45] 0=low" range="13" rwaccess="R/W"/> 
		<bitfield id="POLARITY_108" width="1" begin="12" end="12" resetval="0x1" description=" Polarity for slv_events_in[44] 0=low" range="12" rwaccess="R/W"/> 
		<bitfield id="POLARITY_107" width="1" begin="11" end="11" resetval="0x1" description=" Polarity for slv_events_in[43] 0=low" range="11" rwaccess="R/W"/> 
		<bitfield id="POLARITY_106" width="1" begin="10" end="10" resetval="0x1" description=" Polarity for slv_events_in[42] 0=low" range="10" rwaccess="R/W"/> 
		<bitfield id="POLARITY_105" width="1" begin="9" end="9" resetval="0x1" description=" Polarity for slv_events_in[41] 0=low" range="9" rwaccess="R/W"/> 
		<bitfield id="POLARITY_104" width="1" begin="8" end="8" resetval="0x1" description=" Polarity for slv_events_in[40] 0=low" range="8" rwaccess="R/W"/> 
		<bitfield id="POLARITY_103" width="1" begin="7" end="7" resetval="0x1" description=" Polarity for slv_events_in[39] 0=low" range="7" rwaccess="R/W"/> 
		<bitfield id="POLARITY_102" width="1" begin="6" end="6" resetval="0x1" description=" Polarity for slv_events_in[38] 0=low" range="6" rwaccess="R/W"/> 
		<bitfield id="POLARITY_101" width="1" begin="5" end="5" resetval="0x1" description=" Polarity for slv_events_in[37] 0=low" range="5" rwaccess="R/W"/> 
		<bitfield id="POLARITY_100" width="1" begin="4" end="4" resetval="0x1" description=" Polarity for slv_events_in[36] 0=low" range="4" rwaccess="R/W"/> 
		<bitfield id="POLARITY_99" width="1" begin="3" end="3" resetval="0x1" description=" Polarity for slv_events_in[35] 0=low" range="3" rwaccess="R/W"/> 
		<bitfield id="POLARITY_98" width="1" begin="2" end="2" resetval="0x1" description=" Polarity for slv_events_in[34] 0=low" range="2" rwaccess="R/W"/> 
		<bitfield id="POLARITY_97" width="1" begin="1" end="1" resetval="0x1" description=" Polarity for slv_events_in[33] 0=low" range="1" rwaccess="R/W"/> 
		<bitfield id="POLARITY_96" width="1" begin="0" end="0" resetval="0x1" description=" Polarity for slv_events_in[32] 0=low" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_POLARITY_REG4" offset="0xD10" width="32" description="">
		<bitfield id="POLARITY_159" width="1" begin="31" end="31" resetval="0x1" description=" Polarity for slv_events_in[95] 0=low" range="31" rwaccess="R/W"/> 
		<bitfield id="POLARITY_158" width="1" begin="30" end="30" resetval="0x1" description=" Polarity for slv_events_in[94] 0=low" range="30" rwaccess="R/W"/> 
		<bitfield id="POLARITY_157" width="1" begin="29" end="29" resetval="0x1" description=" Polarity for slv_events_in[93] 0=low" range="29" rwaccess="R/W"/> 
		<bitfield id="POLARITY_156" width="1" begin="28" end="28" resetval="0x1" description=" Polarity for slv_events_in[92] 0=low" range="28" rwaccess="R/W"/> 
		<bitfield id="POLARITY_155" width="1" begin="27" end="27" resetval="0x1" description=" Polarity for slv_events_in[91] 0=low" range="27" rwaccess="R/W"/> 
		<bitfield id="POLARITY_154" width="1" begin="26" end="26" resetval="0x1" description=" Polarity for slv_events_in[90] 0=low" range="26" rwaccess="R/W"/> 
		<bitfield id="POLARITY_153" width="1" begin="25" end="25" resetval="0x1" description=" Polarity for slv_events_in[89] 0=low" range="25" rwaccess="R/W"/> 
		<bitfield id="POLARITY_152" width="1" begin="24" end="24" resetval="0x1" description=" Polarity for slv_events_in[88] 0=low" range="24" rwaccess="R/W"/> 
		<bitfield id="POLARITY_151" width="1" begin="23" end="23" resetval="0x1" description=" Polarity for slv_events_in[87] 0=low" range="23" rwaccess="R/W"/> 
		<bitfield id="POLARITY_150" width="1" begin="22" end="22" resetval="0x1" description=" Polarity for slv_events_in[86] 0=low" range="22" rwaccess="R/W"/> 
		<bitfield id="POLARITY_149" width="1" begin="21" end="21" resetval="0x1" description=" Polarity for slv_events_in[85] 0=low" range="21" rwaccess="R/W"/> 
		<bitfield id="POLARITY_148" width="1" begin="20" end="20" resetval="0x1" description=" Polarity for slv_events_in[84] 0=low" range="20" rwaccess="R/W"/> 
		<bitfield id="POLARITY_147" width="1" begin="19" end="19" resetval="0x1" description=" Polarity for slv_events_in[83] 0=low" range="19" rwaccess="R/W"/> 
		<bitfield id="POLARITY_146" width="1" begin="18" end="18" resetval="0x1" description=" Polarity for slv_events_in[82] 0=low" range="18" rwaccess="R/W"/> 
		<bitfield id="POLARITY_145" width="1" begin="17" end="17" resetval="0x1" description=" Polarity for slv_events_in[81] 0=low" range="17" rwaccess="R/W"/> 
		<bitfield id="POLARITY_144" width="1" begin="16" end="16" resetval="0x1" description=" Polarity for slv_events_in[80] 0=low" range="16" rwaccess="R/W"/> 
		<bitfield id="POLARITY_143" width="1" begin="15" end="15" resetval="0x1" description=" Polarity for slv_events_in[79] 0=low" range="15" rwaccess="R/W"/> 
		<bitfield id="POLARITY_142" width="1" begin="14" end="14" resetval="0x1" description=" Polarity for slv_events_in[78] 0=low" range="14" rwaccess="R/W"/> 
		<bitfield id="POLARITY_141" width="1" begin="13" end="13" resetval="0x1" description=" Polarity for slv_events_in[77] 0=low" range="13" rwaccess="R/W"/> 
		<bitfield id="POLARITY_140" width="1" begin="12" end="12" resetval="0x1" description=" Polarity for slv_events_in[76] 0=low" range="12" rwaccess="R/W"/> 
		<bitfield id="POLARITY_139" width="1" begin="11" end="11" resetval="0x1" description=" Polarity for slv_events_in[75] 0=low" range="11" rwaccess="R/W"/> 
		<bitfield id="POLARITY_138" width="1" begin="10" end="10" resetval="0x1" description=" Polarity for slv_events_in[74] 0=low" range="10" rwaccess="R/W"/> 
		<bitfield id="POLARITY_137" width="1" begin="9" end="9" resetval="0x1" description=" Polarity for slv_events_in[73] 0=low" range="9" rwaccess="R/W"/> 
		<bitfield id="POLARITY_136" width="1" begin="8" end="8" resetval="0x1" description=" Polarity for slv_events_in[72] 0=low" range="8" rwaccess="R/W"/> 
		<bitfield id="POLARITY_135" width="1" begin="7" end="7" resetval="0x1" description=" Polarity for slv_events_in[71] 0=low" range="7" rwaccess="R/W"/> 
		<bitfield id="POLARITY_134" width="1" begin="6" end="6" resetval="0x1" description=" Polarity for slv_events_in[70] 0=low" range="6" rwaccess="R/W"/> 
		<bitfield id="POLARITY_133" width="1" begin="5" end="5" resetval="0x1" description=" Polarity for slv_events_in[69] 0=low" range="5" rwaccess="R/W"/> 
		<bitfield id="POLARITY_132" width="1" begin="4" end="4" resetval="0x1" description=" Polarity for slv_events_in[68] 0=low" range="4" rwaccess="R/W"/> 
		<bitfield id="POLARITY_131" width="1" begin="3" end="3" resetval="0x1" description=" Polarity for slv_events_in[67] 0=low" range="3" rwaccess="R/W"/> 
		<bitfield id="POLARITY_130" width="1" begin="2" end="2" resetval="0x1" description=" Polarity for slv_events_in[66] 0=low" range="2" rwaccess="R/W"/> 
		<bitfield id="POLARITY_129" width="1" begin="1" end="1" resetval="0x1" description=" Polarity for slv_events_in[65] 0=low" range="1" rwaccess="R/W"/> 
		<bitfield id="POLARITY_128" width="1" begin="0" end="0" resetval="0x1" description=" Polarity for slv_events_in[64] 0=low" range="0" rwaccess="R/W"/>
	</register>
