ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG0" offset="0xD80" width="32" description="">
		<bitfield id="TYPE_31" width="1" begin="31" end="31" resetval="0x0" description=" Type for intr_in[31] 0=level" range="31" rwaccess="R/W"/> 
		<bitfield id="TYPE_30" width="1" begin="30" end="30" resetval="0x0" description=" Type for intr_in[30] 0=level" range="30" rwaccess="R/W"/> 
		<bitfield id="TYPE_29" width="1" begin="29" end="29" resetval="0x0" description=" Type for intr_in[29] 0=level" range="29" rwaccess="R/W"/> 
		<bitfield id="TYPE_28" width="1" begin="28" end="28" resetval="0x0" description=" Type for intr_in[28] 0=level" range="28" rwaccess="R/W"/> 
		<bitfield id="TYPE_27" width="1" begin="27" end="27" resetval="0x0" description=" Type for intr_in[27] 0=level" range="27" rwaccess="R/W"/> 
		<bitfield id="TYPE_26" width="1" begin="26" end="26" resetval="0x0" description=" Type for intr_in[26] 0=level" range="26" rwaccess="R/W"/> 
		<bitfield id="TYPE_25" width="1" begin="25" end="25" resetval="0x0" description=" Type for intr_in[25] 0=level" range="25" rwaccess="R/W"/> 
		<bitfield id="TYPE_24" width="1" begin="24" end="24" resetval="0x0" description=" Type for intr_in[24] 0=level" range="24" rwaccess="R/W"/> 
		<bitfield id="TYPE_23" width="1" begin="23" end="23" resetval="0x0" description=" Type for intr_in[23] 0=level" range="23" rwaccess="R/W"/> 
		<bitfield id="TYPE_22" width="1" begin="22" end="22" resetval="0x0" description=" Type for intr_in[22] 0=level" range="22" rwaccess="R/W"/> 
		<bitfield id="TYPE_21" width="1" begin="21" end="21" resetval="0x0" description=" Type for intr_in[21] 0=level" range="21" rwaccess="R/W"/> 
		<bitfield id="TYPE_20" width="1" begin="20" end="20" resetval="0x0" description=" Type for intr_in[20] 0=level" range="20" rwaccess="R/W"/> 
		<bitfield id="TYPE_19" width="1" begin="19" end="19" resetval="0x0" description=" Type for intr_in[19] 0=level" range="19" rwaccess="R/W"/> 
		<bitfield id="TYPE_18" width="1" begin="18" end="18" resetval="0x0" description=" Type for intr_in[18] 0=level" range="18" rwaccess="R/W"/> 
		<bitfield id="TYPE_17" width="1" begin="17" end="17" resetval="0x0" description=" Type for intr_in[17] 0=level" range="17" rwaccess="R/W"/> 
		<bitfield id="TYPE_16" width="1" begin="16" end="16" resetval="0x0" description=" Type for intr_in[16] 0=level" range="16" rwaccess="R/W"/> 
		<bitfield id="TYPE_15" width="1" begin="15" end="15" resetval="0x0" description=" Type for intr_in[15] 0=level" range="15" rwaccess="R/W"/> 
		<bitfield id="TYPE_14" width="1" begin="14" end="14" resetval="0x0" description=" Type for intr_in[14] 0=level" range="14" rwaccess="R/W"/> 
		<bitfield id="TYPE_13" width="1" begin="13" end="13" resetval="0x0" description=" Type for intr_in[13] 0=level" range="13" rwaccess="R/W"/> 
		<bitfield id="TYPE_12" width="1" begin="12" end="12" resetval="0x0" description=" Type for intr_in[12] 0=level" range="12" rwaccess="R/W"/> 
		<bitfield id="TYPE_11" width="1" begin="11" end="11" resetval="0x0" description=" Type for intr_in[11] 0=level" range="11" rwaccess="R/W"/> 
		<bitfield id="TYPE_10" width="1" begin="10" end="10" resetval="0x0" description=" Type for intr_in[10] 0=level" range="10" rwaccess="R/W"/> 
		<bitfield id="TYPE_9" width="1" begin="9" end="9" resetval="0x0" description=" Type for intr_in[9] 0=level" range="9" rwaccess="R/W"/> 
		<bitfield id="TYPE_8" width="1" begin="8" end="8" resetval="0x0" description=" Type for intr_in[8] 0=level" range="8" rwaccess="R/W"/> 
		<bitfield id="TYPE_7" width="1" begin="7" end="7" resetval="0x0" description=" Type for intr_in[7] 0=level" range="7" rwaccess="R/W"/> 
		<bitfield id="TYPE_6" width="1" begin="6" end="6" resetval="0x0" description=" Type for intr_in[6] 0=level" range="6" rwaccess="R/W"/> 
		<bitfield id="TYPE_5" width="1" begin="5" end="5" resetval="0x0" description=" Type for intr_in[5] 0=level" range="5" rwaccess="R/W"/> 
		<bitfield id="TYPE_4" width="1" begin="4" end="4" resetval="0x0" description=" Type for intr_in[4] 0=level" range="4" rwaccess="R/W"/> 
		<bitfield id="TYPE_3" width="1" begin="3" end="3" resetval="0x0" description=" Type for intr_in[3] 0=level" range="3" rwaccess="R/W"/> 
		<bitfield id="TYPE_2" width="1" begin="2" end="2" resetval="0x0" description=" Type for intr_in[2] 0=level" range="2" rwaccess="R/W"/> 
		<bitfield id="TYPE_1" width="1" begin="1" end="1" resetval="0x0" description=" Type for intr_in[1] 0=level" range="1" rwaccess="R/W"/> 
		<bitfield id="TYPE_0" width="1" begin="0" end="0" resetval="0x0" description=" Type for intr_in[0] 0=level" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG1" offset="0xD84" width="32" description="">
		<bitfield id="TYPE_63" width="1" begin="31" end="31" resetval="0x0" description=" Type for intr_in[63] 0=level" range="31" rwaccess="R/W"/> 
		<bitfield id="TYPE_62" width="1" begin="30" end="30" resetval="0x0" description=" Type for intr_in[62] 0=level" range="30" rwaccess="R/W"/> 
		<bitfield id="TYPE_61" width="1" begin="29" end="29" resetval="0x0" description=" Type for intr_in[61] 0=level" range="29" rwaccess="R/W"/> 
		<bitfield id="TYPE_60" width="1" begin="28" end="28" resetval="0x0" description=" Type for intr_in[60] 0=level" range="28" rwaccess="R/W"/> 
		<bitfield id="TYPE_59" width="1" begin="27" end="27" resetval="0x0" description=" Type for intr_in[59] 0=level" range="27" rwaccess="R/W"/> 
		<bitfield id="TYPE_58" width="1" begin="26" end="26" resetval="0x0" description=" Type for intr_in[58] 0=level" range="26" rwaccess="R/W"/> 
		<bitfield id="TYPE_57" width="1" begin="25" end="25" resetval="0x0" description=" Type for intr_in[57] 0=level" range="25" rwaccess="R/W"/> 
		<bitfield id="TYPE_56" width="1" begin="24" end="24" resetval="0x0" description=" Type for intr_in[56] 0=level" range="24" rwaccess="R/W"/> 
		<bitfield id="TYPE_55" width="1" begin="23" end="23" resetval="0x0" description=" Type for intr_in[55] 0=level" range="23" rwaccess="R/W"/> 
		<bitfield id="TYPE_54" width="1" begin="22" end="22" resetval="0x0" description=" Type for intr_in[54] 0=level" range="22" rwaccess="R/W"/> 
		<bitfield id="TYPE_53" width="1" begin="21" end="21" resetval="0x0" description=" Type for intr_in[53] 0=level" range="21" rwaccess="R/W"/> 
		<bitfield id="TYPE_52" width="1" begin="20" end="20" resetval="0x0" description=" Type for intr_in[52] 0=level" range="20" rwaccess="R/W"/> 
		<bitfield id="TYPE_51" width="1" begin="19" end="19" resetval="0x0" description=" Type for intr_in[51] 0=level" range="19" rwaccess="R/W"/> 
		<bitfield id="TYPE_50" width="1" begin="18" end="18" resetval="0x0" description=" Type for intr_in[50] 0=level" range="18" rwaccess="R/W"/> 
		<bitfield id="TYPE_49" width="1" begin="17" end="17" resetval="0x0" description=" Type for intr_in[49] 0=level" range="17" rwaccess="R/W"/> 
		<bitfield id="TYPE_48" width="1" begin="16" end="16" resetval="0x0" description=" Type for intr_in[48] 0=level" range="16" rwaccess="R/W"/> 
		<bitfield id="TYPE_47" width="1" begin="15" end="15" resetval="0x0" description=" Type for intr_in[47] 0=level" range="15" rwaccess="R/W"/> 
		<bitfield id="TYPE_46" width="1" begin="14" end="14" resetval="0x0" description=" Type for intr_in[46] 0=level" range="14" rwaccess="R/W"/> 
		<bitfield id="TYPE_45" width="1" begin="13" end="13" resetval="0x0" description=" Type for intr_in[45] 0=level" range="13" rwaccess="R/W"/> 
		<bitfield id="TYPE_44" width="1" begin="12" end="12" resetval="0x0" description=" Type for intr_in[44] 0=level" range="12" rwaccess="R/W"/> 
		<bitfield id="TYPE_43" width="1" begin="11" end="11" resetval="0x0" description=" Type for intr_in[43] 0=level" range="11" rwaccess="R/W"/> 
		<bitfield id="TYPE_42" width="1" begin="10" end="10" resetval="0x0" description=" Type for intr_in[42] 0=level" range="10" rwaccess="R/W"/> 
		<bitfield id="TYPE_41" width="1" begin="9" end="9" resetval="0x0" description=" Type for intr_in[41] 0=level" range="9" rwaccess="R/W"/> 
		<bitfield id="TYPE_40" width="1" begin="8" end="8" resetval="0x0" description=" Type for intr_in[40] 0=level" range="8" rwaccess="R/W"/> 
		<bitfield id="TYPE_39" width="1" begin="7" end="7" resetval="0x0" description=" Type for intr_in[39] 0=level" range="7" rwaccess="R/W"/> 
		<bitfield id="TYPE_38" width="1" begin="6" end="6" resetval="0x0" description=" Type for intr_in[38] 0=level" range="6" rwaccess="R/W"/> 
		<bitfield id="TYPE_37" width="1" begin="5" end="5" resetval="0x0" description=" Type for intr_in[37] 0=level" range="5" rwaccess="R/W"/> 
		<bitfield id="TYPE_36" width="1" begin="4" end="4" resetval="0x0" description=" Type for intr_in[36] 0=level" range="4" rwaccess="R/W"/> 
		<bitfield id="TYPE_35" width="1" begin="3" end="3" resetval="0x0" description=" Type for intr_in[35] 0=level" range="3" rwaccess="R/W"/> 
		<bitfield id="TYPE_34" width="1" begin="2" end="2" resetval="0x0" description=" Type for intr_in[34] 0=level" range="2" rwaccess="R/W"/> 
		<bitfield id="TYPE_33" width="1" begin="1" end="1" resetval="0x0" description=" Type for intr_in[33] 0=level" range="1" rwaccess="R/W"/> 
		<bitfield id="TYPE_32" width="1" begin="0" end="0" resetval="0x0" description=" Type for intr_in[32] 0=level" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG2" offset="0xD88" width="32" description="">
		<bitfield id="TYPE_95" width="1" begin="31" end="31" resetval="0x0" description=" Type for slv_events_in[31] 0=level" range="31" rwaccess="R/W"/> 
		<bitfield id="TYPE_94" width="1" begin="30" end="30" resetval="0x0" description=" Type for slv_events_in[30] 0=level" range="30" rwaccess="R/W"/> 
		<bitfield id="TYPE_93" width="1" begin="29" end="29" resetval="0x0" description=" Type for slv_events_in[29] 0=level" range="29" rwaccess="R/W"/> 
		<bitfield id="TYPE_92" width="1" begin="28" end="28" resetval="0x0" description=" Type for slv_events_in[28] 0=level" range="28" rwaccess="R/W"/> 
		<bitfield id="TYPE_91" width="1" begin="27" end="27" resetval="0x0" description=" Type for slv_events_in[27] 0=level" range="27" rwaccess="R/W"/> 
		<bitfield id="TYPE_90" width="1" begin="26" end="26" resetval="0x0" description=" Type for slv_events_in[26] 0=level" range="26" rwaccess="R/W"/> 
		<bitfield id="TYPE_89" width="1" begin="25" end="25" resetval="0x0" description=" Type for slv_events_in[25] 0=level" range="25" rwaccess="R/W"/> 
		<bitfield id="TYPE_88" width="1" begin="24" end="24" resetval="0x0" description=" Type for slv_events_in[24] 0=level" range="24" rwaccess="R/W"/> 
		<bitfield id="TYPE_87" width="1" begin="23" end="23" resetval="0x0" description=" Type for slv_events_in[23] 0=level" range="23" rwaccess="R/W"/> 
		<bitfield id="TYPE_86" width="1" begin="22" end="22" resetval="0x0" description=" Type for slv_events_in[22] 0=level" range="22" rwaccess="R/W"/> 
		<bitfield id="TYPE_85" width="1" begin="21" end="21" resetval="0x0" description=" Type for slv_events_in[21] 0=level" range="21" rwaccess="R/W"/> 
		<bitfield id="TYPE_84" width="1" begin="20" end="20" resetval="0x0" description=" Type for slv_events_in[20] 0=level" range="20" rwaccess="R/W"/> 
		<bitfield id="TYPE_83" width="1" begin="19" end="19" resetval="0x0" description=" Type for slv_events_in[19] 0=level" range="19" rwaccess="R/W"/> 
		<bitfield id="TYPE_82" width="1" begin="18" end="18" resetval="0x0" description=" Type for slv_events_in[18] 0=level" range="18" rwaccess="R/W"/> 
		<bitfield id="TYPE_81" width="1" begin="17" end="17" resetval="0x0" description=" Type for slv_events_in[17] 0=level" range="17" rwaccess="R/W"/> 
		<bitfield id="TYPE_80" width="1" begin="16" end="16" resetval="0x0" description=" Type for slv_events_in[16] 0=level" range="16" rwaccess="R/W"/> 
		<bitfield id="TYPE_79" width="1" begin="15" end="15" resetval="0x0" description=" Type for slv_events_in[15] 0=level" range="15" rwaccess="R/W"/> 
		<bitfield id="TYPE_78" width="1" begin="14" end="14" resetval="0x0" description=" Type for slv_events_in[14] 0=level" range="14" rwaccess="R/W"/> 
		<bitfield id="TYPE_77" width="1" begin="13" end="13" resetval="0x0" description=" Type for slv_events_in[13] 0=level" range="13" rwaccess="R/W"/> 
		<bitfield id="TYPE_76" width="1" begin="12" end="12" resetval="0x0" description=" Type for slv_events_in[12] 0=level" range="12" rwaccess="R/W"/> 
		<bitfield id="TYPE_75" width="1" begin="11" end="11" resetval="0x0" description=" Type for slv_events_in[11] 0=level" range="11" rwaccess="R/W"/> 
		<bitfield id="TYPE_74" width="1" begin="10" end="10" resetval="0x0" description=" Type for slv_events_in[10] 0=level" range="10" rwaccess="R/W"/> 
		<bitfield id="TYPE_73" width="1" begin="9" end="9" resetval="0x0" description=" Type for slv_events_in[9] 0=level" range="9" rwaccess="R/W"/> 
		<bitfield id="TYPE_72" width="1" begin="8" end="8" resetval="0x0" description=" Type for slv_events_in[8] 0=level" range="8" rwaccess="R/W"/> 
		<bitfield id="TYPE_71" width="1" begin="7" end="7" resetval="0x0" description=" Type for slv_events_in[7] 0=level" range="7" rwaccess="R/W"/> 
		<bitfield id="TYPE_70" width="1" begin="6" end="6" resetval="0x0" description=" Type for slv_events_in[6] 0=level" range="6" rwaccess="R/W"/> 
		<bitfield id="TYPE_69" width="1" begin="5" end="5" resetval="0x0" description=" Type for slv_events_in[5] 0=level" range="5" rwaccess="R/W"/> 
		<bitfield id="TYPE_68" width="1" begin="4" end="4" resetval="0x0" description=" Type for slv_events_in[4] 0=level" range="4" rwaccess="R/W"/> 
		<bitfield id="TYPE_67" width="1" begin="3" end="3" resetval="0x0" description=" Type for slv_events_in[3] 0=level" range="3" rwaccess="R/W"/> 
		<bitfield id="TYPE_66" width="1" begin="2" end="2" resetval="0x0" description=" Type for slv_events_in[2] 0=level" range="2" rwaccess="R/W"/> 
		<bitfield id="TYPE_65" width="1" begin="1" end="1" resetval="0x0" description=" Type for slv_events_in[1] 0=level" range="1" rwaccess="R/W"/> 
		<bitfield id="TYPE_64" width="1" begin="0" end="0" resetval="0x0" description=" Type for slv_events_in[0] 0=level" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG3" offset="0xD8C" width="32" description="">
		<bitfield id="TYPE_127" width="1" begin="31" end="31" resetval="0x0" description=" Type for slv_events_in[63] 0=level" range="31" rwaccess="R/W"/> 
		<bitfield id="TYPE_126" width="1" begin="30" end="30" resetval="0x0" description=" Type for slv_events_in[62] 0=level" range="30" rwaccess="R/W"/> 
		<bitfield id="TYPE_125" width="1" begin="29" end="29" resetval="0x0" description=" Type for slv_events_in[61] 0=level" range="29" rwaccess="R/W"/> 
		<bitfield id="TYPE_124" width="1" begin="28" end="28" resetval="0x0" description=" Type for slv_events_in[60] 0=level" range="28" rwaccess="R/W"/> 
		<bitfield id="TYPE_123" width="1" begin="27" end="27" resetval="0x0" description=" Type for slv_events_in[59] 0=level" range="27" rwaccess="R/W"/> 
		<bitfield id="TYPE_122" width="1" begin="26" end="26" resetval="0x0" description=" Type for slv_events_in[58] 0=level" range="26" rwaccess="R/W"/> 
		<bitfield id="TYPE_121" width="1" begin="25" end="25" resetval="0x0" description=" Type for slv_events_in[57] 0=level" range="25" rwaccess="R/W"/> 
		<bitfield id="TYPE_120" width="1" begin="24" end="24" resetval="0x0" description=" Type for slv_events_in[56] 0=level" range="24" rwaccess="R/W"/> 
		<bitfield id="TYPE_119" width="1" begin="23" end="23" resetval="0x0" description=" Type for slv_events_in[55] 0=level" range="23" rwaccess="R/W"/> 
		<bitfield id="TYPE_118" width="1" begin="22" end="22" resetval="0x0" description=" Type for slv_events_in[54] 0=level" range="22" rwaccess="R/W"/> 
		<bitfield id="TYPE_117" width="1" begin="21" end="21" resetval="0x0" description=" Type for slv_events_in[53] 0=level" range="21" rwaccess="R/W"/> 
		<bitfield id="TYPE_116" width="1" begin="20" end="20" resetval="0x0" description=" Type for slv_events_in[52] 0=level" range="20" rwaccess="R/W"/> 
		<bitfield id="TYPE_115" width="1" begin="19" end="19" resetval="0x0" description=" Type for slv_events_in[51] 0=level" range="19" rwaccess="R/W"/> 
		<bitfield id="TYPE_114" width="1" begin="18" end="18" resetval="0x0" description=" Type for slv_events_in[50] 0=level" range="18" rwaccess="R/W"/> 
		<bitfield id="TYPE_113" width="1" begin="17" end="17" resetval="0x0" description=" Type for slv_events_in[49] 0=level" range="17" rwaccess="R/W"/> 
		<bitfield id="TYPE_112" width="1" begin="16" end="16" resetval="0x0" description=" Type for slv_events_in[48] 0=level" range="16" rwaccess="R/W"/> 
		<bitfield id="TYPE_111" width="1" begin="15" end="15" resetval="0x0" description=" Type for slv_events_in[47] 0=level" range="15" rwaccess="R/W"/> 
		<bitfield id="TYPE_110" width="1" begin="14" end="14" resetval="0x0" description=" Type for slv_events_in[46] 0=level" range="14" rwaccess="R/W"/> 
		<bitfield id="TYPE_109" width="1" begin="13" end="13" resetval="0x0" description=" Type for slv_events_in[45] 0=level" range="13" rwaccess="R/W"/> 
		<bitfield id="TYPE_108" width="1" begin="12" end="12" resetval="0x0" description=" Type for slv_events_in[44] 0=level" range="12" rwaccess="R/W"/> 
		<bitfield id="TYPE_107" width="1" begin="11" end="11" resetval="0x0" description=" Type for slv_events_in[43] 0=level" range="11" rwaccess="R/W"/> 
		<bitfield id="TYPE_106" width="1" begin="10" end="10" resetval="0x0" description=" Type for slv_events_in[42] 0=level" range="10" rwaccess="R/W"/> 
		<bitfield id="TYPE_105" width="1" begin="9" end="9" resetval="0x0" description=" Type for slv_events_in[41] 0=level" range="9" rwaccess="R/W"/> 
		<bitfield id="TYPE_104" width="1" begin="8" end="8" resetval="0x0" description=" Type for slv_events_in[40] 0=level" range="8" rwaccess="R/W"/> 
		<bitfield id="TYPE_103" width="1" begin="7" end="7" resetval="0x0" description=" Type for slv_events_in[39] 0=level" range="7" rwaccess="R/W"/> 
		<bitfield id="TYPE_102" width="1" begin="6" end="6" resetval="0x0" description=" Type for slv_events_in[38] 0=level" range="6" rwaccess="R/W"/> 
		<bitfield id="TYPE_101" width="1" begin="5" end="5" resetval="0x0" description=" Type for slv_events_in[37] 0=level" range="5" rwaccess="R/W"/> 
		<bitfield id="TYPE_100" width="1" begin="4" end="4" resetval="0x0" description=" Type for slv_events_in[36] 0=level" range="4" rwaccess="R/W"/> 
		<bitfield id="TYPE_99" width="1" begin="3" end="3" resetval="0x0" description=" Type for slv_events_in[35] 0=level" range="3" rwaccess="R/W"/> 
		<bitfield id="TYPE_98" width="1" begin="2" end="2" resetval="0x0" description=" Type for slv_events_in[34] 0=level" range="2" rwaccess="R/W"/> 
		<bitfield id="TYPE_97" width="1" begin="1" end="1" resetval="0x0" description=" Type for slv_events_in[33] 0=level" range="1" rwaccess="R/W"/> 
		<bitfield id="TYPE_96" width="1" begin="0" end="0" resetval="0x0" description=" Type for slv_events_in[32] 0=level" range="0" rwaccess="R/W"/>
	</register>
